import React from 'react'
import { StyleSheet, Text, View, Dimensions, ScrollView, TouchableOpacity, Modal, Image, Linking, Alert } from 'react-native'
import Toast from '@/containers/Toast'
import { connect } from 'react-redux'
import { Actions } from 'react-native-router-flux'
import moment from 'moment'
import * as Animatable from 'react-native-animatable'

const { width, height } = Dimensions.get('window')
const AnimatableView = Animatable.View
export default class HelpCenter extends React.Component {
    constructor(props) {
        super(props)
        this.state = {

        }
    }

    componentDidMount() {

    }

    openLine() {
        Linking.openURL('https://line.me/R/ti/p/@csfun88')
    }



    render() {
        const { } = this.state
        const HelpArr = [
            {
                title: '1. ถอนเงินทำอย่างไร วิธีการถอนเงิน',
                text: [
                    'สมาชิกสามารถทำรายการถอนเงิน ขั้นต่ำ 500 บาท ต่อรายการ สามารถทำรายการถอนได้ตามขั้นตอนดังต่อไปนี้ ',
                    '1. ล็อคอินเข้าระบบ เลือก ธนาคาร และ การถอน',
                    '2. ใส่จำนวนเงิน คลิกที่จุดบัญชีใหม่ เลือกธนาคารที่ท่านต้องการให้เราโอนเงินให้กรณีไม่มีธนาคารที่ต้องการ ให้คลิกที่ ธนาคารอื่นๆ จากนั้นใส่ชื่อธนาคารของท่านที่ต้องการให้เราโอนเงินให้',
                    '3. กรอกชื่อ - นามสกุล',
                    '4. หมายเลขบัญชีธนาคาร จังหวัด เมืองกรอกเป็นอำเภอหรือเขต หากใช้บัญชีนี้เป็นประจำรบกวนทำเครื่องหมายถูกที่ จำรายละเอียดของฉัน เพื่อเพิ่มความสะดวกแก่ท่านในการทำรายการถอนเงินครั้งต่อไป'
                ]
            },
            {
                title: '2. ถอนเงินใช้ระยะเวลาในการอนุมัติกี่นาที ระยะเวลาในการดำเนินการถอนเงิน',
                text: [
                    'ยอดการถอนเงินจะปรับเข้าบัญชีธนาคารของสมาชิกภายใน 30 - 60 นาที หลังจากทำรายการสำเร็จ',
                    'หมายเหตุ : หากสมาชิกแจ้งว่าปกติได้รับเงินเลยไม่เกิน 30 นาที ในส่วนนี้ที่ท่านได้รับเงินจากการถอนเร็วหรือช้าในบางครั้ง เกิดจากทางเราได้มีการเตรียมพัฒนาระบบการถอนรูปแบบใหม่ ซึ่งระบบจะมีการประมวลผลการโอนโดยอัตโนมัติซึ่งจะแตกต่างจากรูปแบบเก่าที่เราส่งไปให้การเงินไทยทำการโอนเงินแบบปกติ โดยที่แบ่งเป็นรอบการส่งเรื่องและนับไปอีก 6 ชั่วโมง หากท่านได้รับเงินล่าช้าเป็นไปได้ว่ารายการนั้นถูกบรรจุอยู่ในระบบเก่า'
                ]
            },
            {
                title: '3. ถอนเงินแล้วแต่ไม่ได้รับเงิน สถานะสำเร็จแต่สมาชิกไม่ได้รับเงิน',
                text: [
                    'หากสมาชิกทำรายการถอนเงินสถานะสำเร็จหรืออนุมัติแล้วแต่ไม่ได้รับเงินที่บัญชีธนาคารของสมาชิก แนะนำสมาชิกเข้ามาแจ้งกับเจ้าหน้าที่ห้องช่วยเหลือสดทันทีพร้อมกับขอความร่วมมือสมาชิกให้อัพเดทสมุดบัญชีธนาคารจนถึงปัจจุบัน ส่งให้ทางเราเพื่อประสานงานกับทางการเงินตรวจสอบ'
                ]
            },
            {
                title: '4. สมัครเว็บไซต์อย่างไร วิธีการสมัครสมาชิกกับทางเว็บไซต์ นั้นทำอย่างไร?',
                text: [
                    'การสมัครสมาชิกท่านสามารถทำการสมัครได้ 2 ช่องทาง - สมัครผ่านหน้าเว็บไซต์ ',
                    '1. สามารถคลิกที่เมนู ลงทะเบียนตอนนี้',
                    ' - สมัครผ่านไลน์นางฟ้าผู้ช่วย',
                    ' 1. ทำการเพิ่มเพื่อนที่ไลน์ ID: @funangel',
                    ' 2. หลังจากแอดเพิ่มเพื่อนแล้วคลิกที่ สมัครสมาชิก'
                ]
            },
            {
                title: '5. ต้องการเปลี่ยนแปลงอีเมลทำอย่างไร ต้องการแก้ไข เปลี่ยนแปลงข้อมูลส่วนตัวจะต้องทำอย่างไร?',
                text: [
                    '1. ท่านสามารถกำหนด หรือ แก้ไขข้อมูลส่วนตัวได้ที่เมนู อัพเดทประวัติ',
                    '2. ข้อมูลที่ท่าน ไม่สามารถ แก้ไขหรือเปลี่ยนแปลงด้วยตัวเองคือ',
                    '2.1 ชื่อยูสเซอร์เนม',
                    '2.2 ชื่อ-นามสกุล',
                    '2.3 อีเมล์ที่',
                    '2.4 วัน/เดือน/ปีเกิด',
                    '2.5 เพศ'
                ]
            },
            {
                title: '6. ลืมรหัสผ่านทำอย่างไร หากลืมรหัสผ่านหรือยูสเซอร์เนม ต้องทำอย่างไร?',
                text: [
                    '1. กรณีทื่ลืมรหัสผ่านนั้นสามารถขอรับอีเมลลืมรหัสผ่านได้ที่เมนู ลืมรหัสผ่าน จากนั้นกรอกข้อมูลอีเมลและยูสเซอร์เนมที่ใช้งาน',
                    '2. กรณีที่ลืมชื่อบัญชีหรือยูสเซอร์เนม สมาชิกสามารถคลิกที่ลืมยูสเซอร์เนมตามภาพแรกทำการใส่อีเมลที่ได้ลงทะเบียนไว้กับเว็ปไซต์เพื่อขอรับยูสเซอร์เนมที่ถูกต้องทางอีเมล'
                ]
            },
            {
                title: '7. ฝากเงินทำอย่างไร ขั้นต่ำเท่าไร วิธีการฝากเงิน',
                text: [
                    'การฝากเงินรูปแบบบัญชีภายในประเทศผ่านเว็บไซต์ ขั้นต่ำ 200 บาท',
                    '1. คลิกที่หัวข้อฝากเงิน เลือกบัญชีภายในประเทศ',
                    '2. คลิกเลือกธนาคาร ดึงข้อมูลเพื่อดูเลขที่ธนาคารของ Fun88',
                    '3. หลังจากทำการโอนเงินเข้ามาแล้วไปที่ขั้นตอนที่ 3 คลิกที่ยืนยันการโอน',
                    '4. กรอกข้อมูลให้ครบถ้วน และเพื่อความรวดเร็วกรุณาแนบสลิปการฝาก คลิกที่ปุ่มตกลง',
                    '5. จะมีขึ้นว่ารายการอยู่ระหว่างดำเนินการ',
                    '6. สมาชิกสามารถตรวจสอบสถานะการฝากเงินได้ที่หัวข้อประวัติ',


                    'ขั้นตอนการแจ้งฝากแบบบัญชีภายในประเทศผ่านไลน์นางฟ้าผู้ช่วย',
                    '1. หลังจากแอดเพิ่มเพื่อนแล้วสมาชิกคลิกเข้าสู่ระบบ ระบุยูสเซอร์เนมและอีเมลตามที่สมัครสมาชิก',
                    '2. กดเริ่มทำรายการฝากเพื่อส่งข้อมูลการฝาก',
                    '3. เลือกบัญชีภายในประเทศกดที่ กรุณาใส่รายละเอียด',
                    '4. เมื่อเลือกบัญชีภายในประเทศให้เลือกธนาคารที่ใช้ฝาก สามารถเลื่อนไปขวามือเพื่อเลือกธนาคารเพิ่มเติม',
                    '5. ระบุชื่อ - นามสกุล เลขที่บัญชีของตนเอง และเลขที่บัญชีของทางเว็บไซด์ 5 ตัวท้าย กลังจากนั้นจะมีข้อความยืนยันการฝากหากข้อมูลถูกต้องสมบูรณ์ให้กดที่ ใช่',
                    '6. เลือกวันที่และเวลาตามสลิปที่สมาชิกทำรายการฝากได้เลยค่ะ 7. หลังจากทำรายการเรียบร้อยแล้วหน้าจอจะแสดงรายการฝากของสมาชิก'
                ]
            },
            {
                title: '8. รายการฝากเมื่อไหร่จะปรับ ระยะเวลาในการอนุมัติรายการ ฝากเงิน',
                text: [
                    'การฝากเงินแบบบัญชีภายในประเทศ ยอดการฝากจะปรับให้ภายใน 15 - 30 นาที หลังจากทำรายการฝากหน้าเว็บสำเร็จ และการฝากเงินแบบ FastBaht ยอดเงินจะปรับเข้าบัญชีผู้ใช้งานภายใน 5 นาที เมื่อทำการยืนยันการฝากสำเร็จ'
                ]
            },
            {
                title: '9. ขอเลขบัญชีธนาคาร บัญชีธนาคาร',
                text: [
                    'สำหรับหมายเลขบัญชีธนาคารการฝากเงินแบบบัญชีภายในประเทศ สามารถตรวจสอบเลขที่บัญชีการฝากเงินล่าสุดของทางเราได้ที่หน้าเว็บไซต์ โดยเลือกที่หัวข้อ “ฝากเงิน” จากนั้นเลือกการฝากเงินแบบบัญชีภายในประเทศ และรบกวนสมาชิกตรวจสอบเลขที่บัญชีก่อนการฝากเงินทุกครั้ง ส่วนนี้บัญชีการฝากเงินทางเรามีการเปลี่ยนแปลงสม่ำเสมอ'
                ]
            },
            {
                title: '10. รับโบนัสเงินฟรีได้อย่างไร โปรโมชั่น',
                text: [
                    'สามารถขอรับได้โดยการยืนยันเบอร์โทรผ่านหน้าเว็บไซต์ การยืนยันตัวตนผ่าน SMS',
                    '1. คลิกที่หัวข้อ อัพเดทประวัติ - SMS การยืนยันตัวตน',
                    '2. รหัสจะส่งไปที่โทรศัพท์ กรุณากรอกรหัสภายใน 5 นาที',
                    '3.เมื่อมีการยืนยันสำเร็จ เงินเดิมพันฟรี จะปรับให้สมาชิกภายใน 3 วัน'
                ]
            }
        ]
        return <View style={[styles.viewContainer, { backgroundColor: window.isBlue ? '#FEFCFF' : '#000' }]}>
            <ScrollView
                automaticallyAdjustContentInsets={false}
                showsHorizontalScrollIndicator={false}
                showsVerticalScrollIndicator={false}
            >
                <View>
                    {
                        HelpArr.map((v, i) => {
                            return <View key={i} style={{ marginBottom: 15 }}>
                                <View style={{
                                    borderBottomWidth: 1,
                                    borderBottomColor: '#BEBEC1',
                                    paddingVertical: 6,
                                    marginBottom: 8
                                }}>
                                    <Text style={{ color: '#4A4A4A', fontWeight: 'bold' }}>{v.title}</Text>
                                </View>
                                <View>
                                    {
                                        v.text.map((v1, i1) => {
                                            return <Text style={{
                                                fontSize: 12,
                                                color: '#4A4A4A'
                                            }} key={i1}>{v1}</Text>
                                        })
                                    }
                                </View>
                            </View>
                        })
                    }
                </View>
                <TouchableOpacity style={[styles.closeBtnWrap, { backgroundColor: window.isBlue ? '#00AEEF' : '#25AAE1' }]}
                    onPress={
                        () => {
                            Actions.LiveChat()
                        }
                    }>
                    <Text style={styles.closeBtnText}>แชทสด​</Text>
                </TouchableOpacity>


                <TouchableOpacity style={[styles.closeBtnWrap, { backgroundColor: window.isBlue ? '#00AEEF' : '#25AAE1' }]}
                    onPress={() => {
                        let url = 'tel:+66 60003587'
                        Linking.canOpenURL(url).then(flag => {
                            Linking.openURL(url)
                        }).catch(err => {
                            Alert.alert('แจ้งเตือน', `อุปกรณ์ของคุณไม่รองรับฟังก์ชันนี้ กรุณากดหมายเลขด้วยตนเอง ${url}`, [
                                { text: 'โอนย้าย' }
                            ])
                        })
                    }}>
                    <Text style={styles.closeBtnText}>สายด่วน : +66 600 035 187</Text>
                </TouchableOpacity>


                <Text style={{ textAlign: 'center', color: '#4A4A4A', fontSize: 20, fontWeight: 'bold' }}>Line ID : @csfun88</Text>

                <TouchableOpacity
                    onPress={() => {
                        this.openLine()
                    }}
                    style={{
                        backgroundColor: '#39CD00',
                        marginHorizontal: 10,
                        width: width - 40,
                        height: 40,
                        justifyContent: 'center',
                        alignItems: 'center',
                        flexDirection: 'row',
                        marginBottom: 20,
                        borderRadius: 60000,
                        marginBottom: 60,
                        marginTop: 20
                    }}>
                    <Image resizeMode='stretch' source={require('./../../images/account/line.png')}
                        style={{
                            width: 25, height: 25,
                            marginRight: 10
                        }} />

                    <Text style={{
                        color: '#FFFFFF',
                        fontWeight: 'bold'
                    }}>ADD FRIEND</Text>
                </TouchableOpacity>
            </ScrollView>
        </View>
    }
}

const styles = StyleSheet.create({
    viewContainer: {
        flex: 1,
        backgroundColor: 'red',
        paddingHorizontal: 10,
        paddingTop: 15
    },
    closeBtnWrap: {
        marginHorizontal: 10,
        width: width - 40,
        height: 40,
        alignItems: 'center',
        justifyContent: 'center',
        marginBottom: 20,
        borderRadius: 6
    },
    closeBtnText: {
        color: '#fff'
    }
})