export const RecommendStepDetail = [
    {
        text: 'แนะนำเพื่อนสมัคร',
        img: require('./../../../images/account/recommend/RecommendStepDetail1.png')
    },
    {
        text: `รับ 300 บาท`,
        img: require('./../../../images/account/recommend/RecommendStepDetail2.png')
    },
    {
        text: `ยิ่งแนะนำมาก ยิ่งได้โบนัสมาก`,
        img: require('./../../../images/account/recommend/RecommendStepDetail3.png')
    }
]

export const RecommendPageTabs = [
    {
        title: 'สถานะการแนะนำ',
        piwikMenberText: 'Referfriend_Mystatus'
    },
    {
        title: 'ระบบแนะนำ',
        piwikMenberText: 'Referfriend_Programinfo'
    }
]

export const RecommendFaq = [
    {
        title: '1. สามารถใช้โบนัสนี้ร่วมกับโปรโมชั่นอื่นๆ ได้หรือไม่',
        text: 'โบนัสนี้สามารถใช้ร่วมกับโปรโมชั่นอื่นได้'
    },
    {
        title: '2. ต้องทำยอดเทิร์นเท่าไหร่ก่อนการถอน',
        text: 'โบนัสมียอดเทิร์น 1 เท่าก่อนการถอน'
    },
    {
        title: '3. หากไม่สามารถยืนยันเบอร์โทรและอีเมลได้',
        text: 'ติดต่อเจ้าหน้าที่ฝ่ายบริการ FUN88 เพื่อให้ความช่วยเหลือได้ทันที'
    },
]

export const RecommendRules = [
    '1. โปรโมชั่นนี้สำหรับสมาชิกปัจจุบันและสมาชิกใหม่ ของ FUN88 สกุลเงินไทย',
    '2. โบนัสฟรี 300 บาท สำหรับสมาชิกผู้แนะนำและผู้ถูกแนะนำ',
    '2.1 ผู้แนะนำ',
    'จะได้รับการปรับโบนัสฟรี 300 บาท ตามเงื่อนไข',
    '- ผู้แนะนำจะต้องทำการยืนยันเบอร์โทร',
    '- ผู้แนะนำและผู้ถูกแนะนำจะต้องมียอดฝากสะสม 1,000 บาทและยอดเทิร์น 3,000 บาท ภายใน 30 วัน นับจากวันสมัครของผู้ถูกแนะนำ',
    '2.2 ผู้ถูกแนะนำ',
    'จะได้รับโบนัสสมาชิกใหม่ 300 บาท ตามเงื่อนไข',
    '- ผู้ถูกแนะนำจะต้องยืนยันเบอร์โทร',
    'ตัวอย่าง',
    'A แนะนำ B',
    'B สมัครเมื่อวันที่ 01/01/22 มียอดฝากเงินสะสม 1,000 บาท มียอดเทิร์นสะสม 3,000 บาท โดยยอดสะสมจะนับจาก 01/01/22 - 30/01/22 และเข้าเงื่อนไข',
    'A จะได้รับโบนัสฟรี 300 บาท (จะต้องยืนยันเบอร์โทรและมียอดเงินฝากสะสม 1,000 บาท มียอดเทิร์นสะสม 3,000 บาท ภายใน 30 วัน นับจากวันสมัครของผู้ถูกแนะนำ)',
    'B จะได้รับโบนัสสมาชิกใหม่ 300 บาท (จะต้องยืนยันเบอร์โทร)',
    'img',
    '3. โบนัสฟรีจะปรับเข้าสู่บัญชีหลักของผู้แนะนำภายใน 24 ชั่วโมง หากเพื่อนที่ถูกแนะนำเข้าเงื่อนไข',
    '4. สมาชิกที่มีการแนะนำเพื่อนได้มากที่สุด 3 อันดับแรกจะได้รับรางวัลพิเศษหลังจากสิ้นสุดระยะเวลาโปรโมชั่น',
    'ดังนี้ อันดับที่ 1: เงินโบนัส 5,000 บาท + iPhone 12 Pro Max มูลค่า 4x,x00 บาท',
    'อันดับที่ 2: เงินโบนัส 3,000 บาท + Samsung Note 10 มูลค่า 3x,x00 บาท',
    'อันดับที่ 3: เงินโบนัส 2,000 บาท + Apple Watch Series 6 มูลค่า 27,x00 บาท',
    'ในกรณีที่ผู้แนะนำสมาชิกใหม่มีจำนวนสูงสุด 3 อันดับแรกมากกว่า 3 ท่าน ผู้แนะนำที่แนะนำสมาชิกใหม่ได้ถึง จำนวนสูงสุด 3 อันดับแรกก่อนจะเป็นผู้ที่ได้รับรางวัล',
    '5. สมาชิกจะได้รับโบนัสในทุกๆ การแนะนำที่ผ่านเงื่อนไขโดยแนะนำสูงสุด 50 คน ในกรณีที่ต้องการแนะนำมากกว่า 50 คน กรุณาติดต่อห้องช่วยเหลือสดเพื่อรับคำแนะนำ',
    '6. ผู้ถูกแนะนำที่รับเงินเดิมพันฟรีจะต้องทำยอดเทิร์น 8 เท่าก่อนการถอน (ยอดเทิร์นคำนวนจาก ยอดเงินเดิมพันฟรี หรือ ยอดชนะหมุนเวียนของเงินเดิมพันฟรี + ยอดฝากแรก x 8เท่า)',
    '7. โปรโมชั่นรีวอร์ดทั้งหมดไม่สามารถใช้ร่วมกับโปรโมชั่นอื่นๆ ได้',
    '8. ทางเราจขอสงวนสิทธิ์ในการเรียกคืนเงินรางวัลเงินสด ในกรณีที่มีการฉ้อโกงด้วยวิธีการอื่นๆ',
    '9. สมาชิกในส่วนของพันธมิตร FUN88 จะไม่สามารถขอรับโปรโมชั่นนี้ได้',
    '10. ชื่อ-สกุล ที่ใช้ลงทะเบียน FUN88 ต้องตรงกับ ชื่อ-สกุล ในบัญชีที่ใช้สำหรับการถอนเงินของคุณ',
    '11. FUN88 ขอสงวนสิทธิ์ในการปฏิเสธแบบฟอร์มการร่วมสนุกกับโบนัสและอาจทำการยกเลิกโบนัสดังกล่าว หรือยอดเงินเดิมพันที่ชนะจากการใช้เงินโบนัสในกรณีที่ผู้ร่วมสนุกไม่สามารถปฏิบัติตามเงื่อนไขและข้อตกลงข้อที่ 8 ของโปรโมชั่น',
    '12. โปรโมชั่นนี้ไม่สามารถใช้ร่วมกับโปรโมชั่นอื่นๆ ได้ยกเว้นแต่จะระบุไว้ สมาชิกสามารถมีโบนัสที่ใช้งานได้ เพียงหนึ่งโบนัสในบัญชีเดียวกัน หากต้องการรับโบนัสอื่นๆ ในบัญชีเดียวกัน จะต้องทำยอดเทิร์นของโบนัทที่มีอยู่ให้ครบก่อน',
    '13. ทุกข้อเสนอถูกจำกัดสำหรับ 1 ท่าน, ครอบครัว, ที่อยู่, อีเมล, เบอร์โทรศัพท์, บัญชีธนาคารและ IP แอดเดรสเดียวเท่านั้น',
    '14. โปรโมชั่นนี้มีขึ้นเพื่อความบันเทิงสำหรับสมาชิก และ FUN88 ขอสงวนสิทธิ์ในการพิจารณาแก้ไข เปลี่ยนแปลงการร่วมสนุกของสมาชิกในโปรโมชั่น แต่เพียงผู้เดียว',
    '15. ทางเราขอสงวนสิทธิ์ในการเปลี่ยนแปลง แก้ไข หรือยกเลิกโปรโมชั่นนี้ หรือกรณีใดๆ ก็ตามโดยไม่ต้องแจ้งให้ทราบล่วงหน้า'



]

export const recommendIcon = [
    {
        type: 'qrcode',
        text: 'QR Code',
        img: require('./../../../images/account/recommend/recommendIcon1.png'),
        piwikMenberText: 'Refer_QR'
    },
    {
        type: 'email',
        text: 'แชร์ให้เพื่อนผ่านทางช่องทางโซเชียล',
        img: require('./../../../images/account/recommend/recommendIcon2.png'),
        piwikMenberText: 'Refer_Email'
    },
    {
        type: 'line', ///
        text: 'จาก: คุณ',
        img: require('./../../../images/account/recommend/recommendIcon4.png'),
        piwikMenberText: 'Refer_Email'
    },
    {
        type: 'facebook',
        text: 'โพสต์ไปยังเฟสบุ๊คของคุณ',
        img: require('./../../../images/account/recommend/recommendIcon3.png'),
        piwikMenberText: 'Refer_Facebook'
    },
]

export const RecommendHomeModalInfor = [
    {
        text: 'ลงทะเบียน',
        img1: require('./../../../images/account/recommend/recommendModalIcon1.png'),
        img1: require('./../../../images/account/recommend/recommendModalIconActive1.png'),
    },
    {
        text: 'ยืนยันชื่อนามสกุลจริง',
        img1: require('./../../../images/account/recommend/recommendModalIcon2.png'),
        img1: require('./../../../images/account/recommend/recommendModalIconActive2.png'),
    },
    {
        text: 'ยืนยันเบอร์โทรศัพท์และอีเมล ',
        img1: require('./../../../images/account/recommend/recommendModalIcon2.png'),
        img1: require('./../../../images/account/recommend/recommendModalIconActive2.png'),
    },
]

// 1 Pending
// 2 Approved
// 3 PendingRetry
// 4 Processing
// 5 Rejected
export const ReferreeDetailStatus = {
    status1: { // Pending
        text: 'กำลังรอคุณอยู่',
        color: '#BFBFBF'
    },
    status2: {// Approved
        text: 'สำเร็จ',
        color: '#21DB00'
    },
    status3: {// PendingRetry
        text: 'กำลังรอคุณอยู่',
        color: '#BFBFBF'
    },
    status4: {// Processing
        text: 'กำลังดำเนินการ',
        color: '#BFBFBF'
    },
    status5: {// Rejected
        text: 'ล้มเหลว',
        color: '#E30000'
    },
}